app/controllers/users_controller.rb

  def index
    p "In index!!!!!!!!!!!!!!!!!!!!!!!!!!"

    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    p "*" * 50
    p "creating new user! user params: #{user_params}"
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "aaaa"], ["last_name", "bbbb"], ["email", "sadf@sdfklj.com"], ["created_at", "2015-09-30 00:59:01.951995"], ["updated_at", "2015-09-30 00:59:01.951995"]]